//
//  ViewModel.swift
//  NeaKallistiRodopis
//
//  Created by Angelos Staboulis on 12/1/25.
//

import Foundation
class ViewModel:ObservableObject{
    var history:[String] = []
    func createHistory()->[String]{
        history.append(
            """
            Από Φυλλοχώρι (Γκαγκαβούζηδες), από Χαριούπολη (Ρουμανόβλαχοι), και από Χάσκιοϊ (Λευκάσιοϊ) Ηράκλειας Μαλγάρων Ραιδεστού, εγκαταστάθηκαν και πρόκοψαν στο σημερινό χωριό
            Η Νέα Καλλίστη βρίσκεται νότια του νομού Ροδόπης σε απόσταση 20 χιλιόμετρα από την Κομοτηνή και σε υψόμετρο 15 μέτρα από την επιφάνεια της θάλασσας.
            Δύο μεγάλες ομάδες προσφύγων μετά το 1922 εγκαταστάθηκαν στη Νέα Καλλίστη, όλοι προερχόμενοι από την Ανατολική Θράκη. Η μια ομάδα ήταν από το Φυλλοχώρι (Καρά Χαλήλ) υποδιοικήσεως Αρτίσκου ή Ελευθερών (Μπαμπά Εσκή) 40 Εκκλησιών και η άλλη ομάδα από το Χάσκιοϊ Αν. Θράκης. Στη Νέα Καλλίστη εγκαταστάθηκαν επίσης και 2-3 οικογένειες προσφύγων Ρουμανόβλαχων από την Χαριούπολη Αν. Θράκης. Το 1950 εγκαταστάθηκαν στο χωριό και 3 οικογένειες Σαρακατσάνων οι Γεωργανταίοι με καταγωγή από Αν. Θράκη (Πολίτες) και ρίζες από την Στερεά Ελλάδα.
            Οι πρόσφυγες που κατάγονται από το Χάσκιοϊ μιλούσαν όλοι μόνο ελληνικά και όταν ήλθαν στην ελεύθερη Ελλάδα πρωτοεγκαταστάθηκαν για 1-2 χρόνια στο Μικρό Παλλάδιο, ύστερα έφυγαν και εγκαταστάθηκαν πάλι για λίγο καιρό στο Φυτόκιο (Ανθή) Νιγρίτας Σερρών. Σε λίγο καιρό πάλι επέστρεψαν και εγκαταστάθηκαν σε απαλλοτριωμένο από την κυβέρνηση Ν. Πλαστήρα τσιφλίκι μουσουλμάνου.
            Ο Ν. Πλαστήρας είχε απαλλοτριώσει όλα τα τσιφλίκια της Ροδόπης χριστιανικά και μουσουλμανικά που ξεκινούσαν από την Κομοτηνή και έφταναν μέχρι την θάλασσα και τα μοίρασε στους πρωτοεγκατεστημένους πρόσφυγες.
            """
        )
        history.append(
          """
          Έτσι η Επιτροπή Αποκατάστασης Προσφύγων τους μοίρασε τα οικόπεδα και βοηθώντας ο ένας τον άλλον με πλιθιά έκτισαν τα σπίτια τους. Σε λίγο εγκαταστάθηκαν και οι πρόσφυγες από το Φυλλοχώρι (Καρά-Χαλήλ). Το Φυλλοχώρι το 1920 είχε 1092 Έλληνες Τουρκόφωνους κατοίκους. Στο Φυλλοχώρι όπως και σε μια ομάδα χωριών των 40 Εκκλησιών οι Έλληνες αυτοί μιλούσαν την τουρκική γλώσσα που ήταν πράγμα ασύνηθες για την Ανατολική Θράκη.
          Όλοι αυτοί οι τουρκόφωνοι κάτοικοι των χωριών αυτών αποκαλούσαν τον εαυτό τους "Ρούμογλου Ρούμ" εξ Ελλήνων Έλληνες. Το σχολικό έτος 1903-1904 είχε το σχολείο 20 μαθητές με έναν διδάσκαλο.
          Το 1904 όπως και το 1906 το ελληνικό προξενείο της Αδριανούπολης χορηγούσε μισθό διδασκάλων στο Καρά - Χαλήλ το ποσό των 6,66 χρυσές λίρες Τουρκίας. Επίσης το 1904 η Αδελφότης "Αγαπάτε αλλήλους" της Κωνσταντινούπολης, χορηγούσε στον διδάσκαλο το ποσό των 25 χρυσές λιρών Τουρκίας. Στο σχολικό έτος επίσης του 1906-07 ο προϋπολογισμός του ελληνικού προξενείου της Αδριανουπόλεως για τον διδάσκαλο του Καρά-Χαλήλ ήταν 20 χρυσές λίρες Τουρκίας.
          Οι τουρκόφωνοι Έλληνες του Καρά-Χαλήλ είναι οι λεγόμενοι Γκαγκαβούζηδες, είναι ένας λαός περήφανος για την καταγωγή του που προσδιορίζεται στο Βυζάντιο και στα βυζαντινά χρόνια. Λόγω της Τουρκοφωνίας τους τα παλιά χρόνια δεν αναφέρεται από καμιά ιστορική πηγή ότι κάποιο τουρκικό φύλο εκχριστιανίστηκε. Αντίθετα αναφέρονται μαζικοί εξισλαμισμοί χριστιανικών πληθυσμών στην Μικρά Ασία και στα Βαλκάνια. Στην ιστορία οι Γκαγκαβούζηδες καταγράφονται ως θρακικό φύλλο.
          """
        )
        history.append(
            """
            Για πρώτη φορά εντοπίζονται στα παράλια του Δυτικού Εύξεινου Πόντου στην Δομβρουτσά, μεταξύ της πόλης Βάρνας και Δούναβη. Υποδουλώθηκαν στους Οθωμανούς περί το 1394-1398. Σ' αυτά τα δύσκολα χρόνια θεωρούμε πως έχασαν την ελληνική γλώσσα τους, όπως πολλοί υπόδουλοι Έλληνες κρατώντας την θρησκεία τους.
            Οι Γκαγκαβούζηδες συμμετείχαν με δικό τους στρατευτικό σώμα, στην επανάσταση του Υψηλάντη με αρχηγό τον Δημήτρη Βατικιώτη. Επίσης συμμετείχαν και στον Ιερό Λόχο αντιμετωπίζοντας την οργή των Οθωμανικών στρατευμάτων. Τότε πολλά χωριά λεηλατήθηκαν και πυρπολήθηκαν οπότε αναγκάστηκαν να μετακινηθούν οι περισσότεροι στην σημερινή Μολδαβία στην αυτόνομη Δημοκρατία της Γκαγκαουζίας, όπου ζουν μέχρι σήμερα περί τις 150.000. Μέχρι το 1957 γράφανε με το ελληνικό αλφάβητο όπως και οι τουρκόφωνοι Καππαδόκες, μετά "επισήμως" άλλαξε το αλφάβητο σε λατινικό.
            Μεγάλος αριθμός Γκαγκαβούζηδων μετακινήθηκε, επίσης νότια στην Βόρεια, στην Δυτική και στην Ανατολική Θράκη. Τότε πιθανόν εγκαταστάθηκαν στα 5-6 χωριά γύρω από τις 40 Εκκλησιές Αν. Θράκης. Στα χρόνια που ακολούθησαν ταυτίστηκαν με τους υπόλοιπους Έλληνες της περιοχής.
            Τον Ιούνιο του 1920 κατά την απελευθέρωση της Αν. Θράκης, όταν μπήκε ο ελληνικός στρατός απελευθερωτής το 10ο Σύνταγμα Στρατού αποτελείτο από 700 Γκαγκαβούζηδες. Τότε ήταν που το Καρά-Χαλήλ μετονομάστηκε σε Φυλλοχώρι.
            """
        )
        history.append(
            """
            Με την εγκατάλειψη της Αν. Θράκης όλος ο Ελληνισμός της Ανατολής όπως και οι Έλληνες Γκαγκαβούζηδες πήραν τον δρόμο της προσφυγιάς. Η μεγαλύτερη πληθυσμιακή μάζα εγκαταστάθηκε στον Βόρειο Έβρο σε χωριά της Ορεστιάδας και του Διδυμοτείχου καθώς και στα Χρυσοχώραφα Σερρών στον Δήμο Λαγκαδά, στη Σίνδο, στο Κιλκίς, στην Θεσσαλία και αλλού. Εκατοντάδες χρόνια πριν Γκαγκαβούζηδες εγκαταστάθηκαν ήδη στον Άγιο Χριστόφορο, στη Νέα Ζίχνη Σερρών και σε άλλα μέρη της Ελλάδας.
            Στην Ροδόπη Γκαγκαβούζηδες είναι όλοι οι κάτοικοι των Αμφίων Σαπών που κατάγονται από το Χάσκιοϊ - Χάφσα (Καθάριο) νομού Αδριανουπόλεως και ένα μέρος της Νέας Καλλίστης που όπως προαναφέραμε κατάγονται από το Φυλλοχώρι (Καρά-Χαλήλ) 40 Εκκλησιών. Όπως και μεμονωμένες οικογένειες σε ορισμένα χωριά τη Ροδόπης.
            Οι Γκαγκαβούζηδες της Ν. Καλλίστης, οι πρόσφυγες αυτοί ξεριζωμένοι από την γη των προγόνων τους έφεραν μαζί με την πίκρα του ξεριζωμού, θρησκευτικές παραδόσεις και το ελληνικό εθνικό φρόνημα. Η μακραίωνη σκλαβιά τους κατά την οθωμανική κυριαρχία δεν στάθηκε ικανή να εξαλείψει την πίστη τους και την αγάπη στην πατρίδα άσχετο αν στο παρελθόν προς στιγμή στερήθηκαν την ελληνική γλώσσα και κανείς δεν μπορεί να αμφισβητήσει το εθνικό τους φρόνημα.
            Οι Γκαγκαβούζηδες της Νέας Καλλίστης έχουν ορισμένοι από αυτούς συγγενείς στα Χρυσοχώραφα και στην Γκαγκαουζία της Μολδαβίας. Επί δημαρχίας Λίτσου είχαν πολλές ανταλλαγές επισκέψεων με Γκαγκαβούζηδες από την Μολδαβία, μάλιστα το 2006 ομάδα Νεοκαλλιστινών μετέβη στην Μολδαβία στο 1ο Παγκόσμιο αντάμωμα των Γκαγκαβούζηδων μαζί με άλλους δύο συλλόγους της Ινόης του Έβρου και των Χρυσοχώραφων Σερρών όπου βρήκαν πολλούς συγγενείς τους.
            """
        )
        history.append(
            """
            Το 2008 έγινε το πρώτο αντάμωμα των Γκαγκαβούζηδων στην Ελλάδα στην Ορεστιάδα έκτοτε κάθε δύο χρόνια γίνεται το αντάμωμα και έρχονται Γκαγκαβούζηδες μέχρι και από την Αυστραλία. Έτσι θα πρέπει ο Δήμος Κομοτηνής μαζί με την τυπική κοινότητα της Νέας Καλλίστης όπως και ο Δήμος Μαρώνειας Σαπών μαζί με την τοπική κοινότητα Αμφίων θα πρέπει κάποια χρονιά να οργανώσουν και αυτοί ένα πανελλήνιο αντάμωμα Γκαγκαβούζηδων καλώντας και τα αδέλφια μας από την Γκαγκαβουζία της Μολδαβίας μιας και λόγω γλώσσας η Τουρκία έχει απλώσει το καρκινογόνο μακρύ χέρι της μέχρι και εκεί.
            Στη Νέα Καλλίστη εγκαταστάθηκαν και 2-3 οικογένειες Ρουμανόβλαχων, ήταν όλοι συγγενείς μεταξύ τους με καταγωγή από την περιοχή της Χαριούπολης Αν. Θράκης. Ήταν νοικοκύρηδες, καλοί άνθρωποι, καλοί σιδηρουργοί και πολυτεχνίτες.
            Μετά την εγκατάσταση όλων των προσφύγων στο χωριό μοίρασαν σε κάθε οικογένεια από 35 στρέμματα χωράφια. Όλοι οι πρόσφυγες μαζί έκτισαν πρώτα την εκκλησία η οποία σε λίγο έπεσε και αμέσως έκτισαν μια νέα με ένα σπίτι μαζί για τον ιερέα. Το 1931 έκτισαν και το μονοθέσιο σχολείο. Επειδή όμως ήταν μικρό σε λίγο καιρό πρόσθεσαν και άλλες αίθουσες φέρνοντας πέτρες από το Φανάρι από το σημείο που βρίσκεται σήμερα το Τουριστικό όπου υπήρχαν άφθονες φυσικές πέτρες. Σήμερα λειτουργεί ως τετραθέσιο.
            Επίσης χτύπησαν και δύο γεωτρήσεις που άρχισε να βγαίνει και αρτεσιανό νερό. Το νερό το έβγαζαν γυρίζοντας με μανιβέλα έναν μεταλλικό τροχό. Το 1953 περνώντας από την Νέα Καλλίστη η βασίλισσα Φρειδερίκη σταμάτησε στο χωριό όπου της πρόσφεραν καφέ και την παρακάλεσαν επειδή το χωριό έπαιρνε νερό από τις τουλούμπες να παρέμβει για να χτιστεί μια δεξαμενή όπως και έγινε.
            """
        )
        history.append(
            """
            Όταν ήλθαν οι έποικοι Βούλγαροι στο χωριό το 1941 εγκαταστάθηκαν σε σπίτια των Ελλήνων βάζοντας τους να διαμένουν ανά 3 οικογένειες σε ένα σπίτι. Τους άρπαξαν τα χωράφια όπως και πολλά από τα ζώα τους. Κάθε μέρα ξύλο - ξύλο και πείνα "έκλεβαν" από τα χωράφια τους λίγο σιτάρι και με μεγάλο κίνδυνο το βράδυ πήγαιναν στον μύλο στον Πολύανθο όπου και το άλεθαν.
            Από το χωριό έστειλαν στην Βουλγαρία και ορισμένους κατοίκους ως ντουρντουβάκια (υποχρεωτική δωρεάν εργασία για το κράτος της Βουλγαρίας), εκεί έμειναν μέχρι το 1944. Όταν πρωτοεγκαταστάθηκαν οι πρόσφυγες Χασκιώτες εγκαταστάθηκαν νότια του χωριού και οι Γκαγκαβούζηδες βόρεια, παλιότερα βρισκόταν σε μεγάλη αντίθεση, καθώς δεν είχαν καθόλου καλές σχέσεις, σιγά - σιγά όμως όπως και μετά από τον πρώτο γάμο που έγινε μεταξύ τους το 1952 όλα έστρωσαν.
            Τα πρώτα χρόνια το χωριό μέχρι την λίμνη Βιστωνίδα το μέρος ήταν σαν ζούγκλα είχε πολλά μεγάλα δένδρα, θάμνους, έλη, αγριογούρουνα, λύκους, καθώς και όλα τα άλλα άγρια ζώα. Όλοι ψάρευαν ψάρια από την λίμνη, ειδικά όταν πλημμύριζε έβγαιναν τα ψάρια μέχρι δίπλα στο χωριό. Μετά την δεκαετία του 1950 άρχισε ο περισσότερες κόσμος να μεταναστεύει. Η μεγαλύτερη ομάδα μετανάστευσε στην Γερμανία γύρω στα 420 άτομα. Όλοι αυτοί μετά από κάποια χρόνια επέστρεψαν στο χωριό αφού απέκτησαν περιουσία, ορισμένοι μάλιστα και σπούδασαν.
             Το 2015 κτίστηκε ο ναΐσκος της Αγίας Καλλίστης στον περίβολο του κτιρίου της τοπικής κοινότητας του χωριού, εγκαινιάσθηκε από τον Μητροπολίτη Μαρωνείας και Κομοτηνής κ.κ. Παντελεήμωνα. 
            """
        )
        history.append("""
            Η Αγία Καλλίστη ήταν μια από τις 40 παρθένες που μαρτύρησαν για την πίστη τους και γιορτάζει κάθε 1η Σεπτεμβρίου.
            Το 2015 κτίστηκε ο ναΐσκος της Αγίας Καλλίστης στον περίβολο του κτιρίου της τοπικής κοινότητας του χωριού, εγκαινιάσθηκε από τον Μητροπολίτη Μαρωνείας και Κομοτηνής κ.κ. Παντελεήμωνα. Η Αγία Καλλίστη ήταν μια από τις 40 παρθένες που μαρτύρησαν για την πίστη τους και γιορτάζει κάθε 1η Σεπτεμβρίου.
            Κεντρικός ναός του χωριού είναι ο Άγιος Δημήτριος με εφημέριο τον πρεσβύτερο Ιωάννη Δημητρακόπουλο. Ο οικισμός το 1923 όταν πρωτοδημιουργήθηκε πήρε το όνομα Καλλίστη. Παλαιά ανήκε στην Κοινότητα της Σάλπης και στις 22-1-1962 μετονομάστηκε σε Νέα Καλλίστη. Σήμερα ανήκει στον Δήμο Κομοτηνής.    
            Στη Νέα Καλλίστη λειτουργεί από το 1991 ο Πολιτιστικός Σύλλογος Γυναικών που διατηρεί χορευτικά τμήματα, διοργανώνει εκδρομές στις αξέχαστες πατρίδες των προγόνων τους καθώς επίσης αναβιώνει τα ήθη και έθιμα των τόπων καταγωγής τους αναδεικνύοντας έτσι την πολιτιστική κληρονομιά του τόπου.
        """)
        return history
    }
}
